# UnableToMoveElemsToProject Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..GroupFailures..::..UnableToMoveElemsToProject Property
BuiltInFailures..::..GroupFailures Class See Also
---
Revit is unable to move the selected group members to the project.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId UnableToMoveElemsToProject { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property UnableToMoveElemsToProject As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ UnableToMoveElemsToProject {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..GroupFailures Class
Autodesk.Revit.DB Namespace